app/controllers/calendar_controller.rb

SELECT "gratitudes".* FROM "gratitudes" WHERE "gratitudes"."user_id" = ?  [["user_id", 1]]
---
  def show
    # parses the date
    @date = params[:date] ? Date.parse(params[:date]) : Date.today
    @gratitudes = current_user.gratitudes.group_by{ |grad| grad.created_at.to_date }