app/controllers/gratitudes_controller.rb

  def index
    user = current_user
    gratitudes = user.gratitudes
    @gratitudes = gratitudes.where("created_at >= ?", Time.zone.now.beginning_of_day)
---
SELECT "gratitudes".* FROM "gratitudes" WHERE "gratitudes"."user_id" = ? AND (created_at >= '2016-03-03 00:00:00.000000')  [["user_id", 1]]

  def create
    user = current_user
    @gratitude = user.gratitudes.new(gratitude_params)
    # @gratitude.user_id = current_user.id

    if @gratitude.save
---
INSERT INTO "gratitudes" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "family"], ["user_id", 1], ["created_at", "2016-03-03 18:55:04.084270"], ["updated_at", "2016-03-03 18:55:04.084270"]]

  def destroy
    @gratitude = Gratitude.find(params[:id])
    @gratitude.destroy
---
SELECT  "gratitudes".* FROM "gratitudes" WHERE "gratitudes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "gratitudes" WHERE "gratitudes"."id" = ?  [["id", 1]]