app/controllers/gratitudes_controller.rb

  def allgrads
    @gratitudes = current_user.gratitudes.group_by{ |grad| grad.created_at.to_date}
---
SELECT "gratitudes".* FROM "gratitudes" WHERE "gratitudes"."user_id" = ?  [["user_id", 1]]